// app.js

//是否使用mock数据
let debug = false;

if (debug) {
    var Mock = require("./utils/mock.mp.js");
    // var Mock = require("./utils/WxMock.js"); 
    Mock.setup({
        timeout: '0-3000'
    })

    Mock.mock("https://www.tjensoprediction.com:8888/enso/mainPage_new", {
        "availableMonth": ["2023-02", "2023-03"],
        "data": {
            "2023-02": {
                "xAxis": {
                    "data": ["Feb-23", "Mar-23", "Apr-23", "May-23", "Jun-23", "Jul-23", "Aug-23", "Sep-23", "Oct-23", "Nov-23", "Dec-23", "Jan-24", "Feb-24", "Mar-24", "Apr-24", "May-24", "Jun-24", "Jul-24"]
                },
                "series": [{
                    "data": [-0.53, -0.35, -0.31, -0.13, -0.07, -0.02, 0.08, 0.11, 0.22, 0.47, 0.56, 0.92, 0.75, 0.41, 0.01, -0.03, -0.11, -0.29],
                    "name": "ef",
                    "type": "line"
                }, {
                    "data": [-0.25, 0.34, 0.41, 0.45, 0.19, -0.22, -0.44, -0.67, -0.32, 0.14, 0.41, 1.5, 1.33, 0.97, 0.53, 0.41, 0.18, -0.76],
                    "name": "ENSO-ASC",
                    "type": "line"
                }, {
                    "data": [-0.44, -0.29, -0.15, 0.23, 0.46, 0.7, 0.94, 1.12, 1.14, 1.52, 1.69, 1.81, 1.7, 1.42, 0.94, 0.67, 0.37, 0.27],
                    "name": "ENSO-Cross",
                    "type": "line"
                }, {
                    "data": [-0.6, -0.33, -0.06, 0.13, 0.18, 0.12, 0.09, 0.12, 0.16, 0.33, 0.14, 0.29, 0.14, -0.04, -0.17, 0.01, -0.05, -0.12],
                    "name": "ENSO-GTC",
                    "type": "line"
                }, {
                    "data": [-0.84, -1.11, -1.45, -1.34, -1.1, -0.69, -0.28, -0.13, -0.11, -0.12, -0.01, 0.06, -0.17, -0.71, -1.25, -1.2, -0.94, -0.57],
                    "name": "ENSO-MC",
                    "type": "line"
                }]
            },
            "2023-03": {
                "xAxis": {
                    "data": ["Mar-23", "Apr-23", "May-23", "Jun-23", "Jul-23", "Aug-23", "Sep-23", "Oct-23", "Nov-23", "Dec-23", "Jan-24", "Feb-24", "Mar-24", "Apr-24", "May-24", "Jun-24", "Jul-24", "Aug-24"]
                },
                "series": [{
                    "data": [-0.03, -0.01, -0.15, -0.16, -0.21, -0.06, 0.08, 0.28, 0.43, 0.55, 0.92, 0.88, 0.62, 0.23, -0.01, -0.16, -0.42, -0.37],
                    "name": "ef",
                    "type": "line"
                }, {
                    "data": [0.43, 0.43, 0.43, 0.14, -0.27, -0.47, -0.66, -0.34, 0.1, 0.42, 1.51, 1.37, 1.02, 0.57, 0.38, 0.16, -0.76, -0.83],
                    "name": "ENSO-ASC",
                    "type": "line"
                }, {
                    "data": [0.13, 0.36, 0.28, 0.27, 0.21, 0.52, 0.99, 1.27, 1.34, 1.53, 1.62, 1.86, 1.92, 1.59, 0.85, 0.21, -0.29, -0.31],
                    "name": "ENSO-Cross",
                    "type": "line"
                }, {
                    "data": [-0.13, 0.0, -0.01, 0.04, -0.09, -0.01, 0.11, 0.29, 0.37, 0.24, 0.48, 0.46, 0.28, 0.01, -0.05, -0.07, -0.05, -0.02],
                    "name": "ENSO-GTC",
                    "type": "line"
                }, {
                    "data": [-0.56, -0.83, -1.29, -1.1, -0.69, -0.28, -0.13, -0.11, -0.12, -0.01, 0.06, -0.17, -0.71, -1.25, -1.2, -0.94, -0.57, -0.34],
                    "name": "ENSO-MC",
                    "type": "line"
                }]
            }
        },
        "description": {
            "2023-02": "于2023年冬季发展为厄尔尼诺事件， Niño 3.4指数峰值为1.06，随后逐渐减弱，于24年4月份过渡为中性状态。",
            "2023-03": "于2023年冬季发展为厄尔尼诺事件， Niño 3.4指数峰值为0.91，随后逐渐减弱，于24年4月份过渡为中性状态。"
        }
    })

    Mock.mock("https://www.tjensoprediction.com:8888/enso/analyzePage", {
        "chart1": "此处为预测结果汇总折线图。除22年10月-23年1月外，其他月份的预测结果与官方记录差异不大。预测误差较大可能与近年来连续冷（拉尼娜）事件快结束时状态不稳定有关。",
        "chart2": "此处的12副图分别为从2022年2月~2023年1月起报的预测结果、官方记录结果及二者绝对差值图（柱状）",
        "chart3": "此处为不同起报月份的绝对差值分布箱型图。大多数情况下绝对差值较小，除8月起报以外，8月起报结果在今年1月份预测误差较大。",
        "chart4": "此处为不同起报月份的相关性技巧折线图。各相关性系数技巧均超过0.6，平均达到0.75以上。"
    })
    
    Mock.mock("https://www.tjensoprediction.com:8888/ice/description?year=2023", "2023年9月SIE极小值预测为4.4133，相较于2022年观测偏低，2023年海冰范围预计将比2022年整体偏少。")
}


App({
    onLaunch() {
        // 展示本地存储能力
        // const logs = wx.getStorageSync('logs') || []
        // logs.unshift(Date.now())
        // wx.setStorageSync('logs', logs)

        // 登录
        // wx.login({
        //     success: res => {
        //         // 发送 res.code 到后台换取 openId, sessionKey, unionId
        //     }
        // })
    },
    globalData: {
        baseUrl: 'https://www.tjensoprediction.com:8888'
    }
})