// app.js

//是否使用mock数据
let debug = true;

if (debug) {
    var Mock = require("./utils/mock.mp.js");
    // var Mock = require("./utils/WxMock.js"); 
    Mock.setup({
        timeout: '0-1000'
    })

    Mock.mock('https://www.tjensoprediction.com:8888/enso/mainPage', {
        "availableMonth": ["2023-02", "2023-03"],
        "data": {
            "2023-02": {
                "xAxis": {
                    "data": ["Feb-23", "Mar-23", "Apr-23", "May-23", "Jun-23", "Jul-23", "Aug-23", "Sep-23", "Oct-23", "Nov-23", "Dec-23", "Jan-24", "Feb-24", "Mar-24", "Apr-24", "May-24", "Jun-24", "Jul-24"]
                },
                "series": [{
                    "data": [-0.53, -0.35, -0.31, -0.13, -0.07, -0.02, 0.08, 0.11, 0.22, 0.47, 0.56, 0.92, 0.75, 0.41, 0.01, -0.03, -0.11, -0.29],
                    "name": "ef",
                    "type": "line"
                }, {
                    "data": [-0.25, 0.34, 0.41, 0.45, 0.19, -0.22, -0.44, -0.67, -0.32, 0.14, 0.41, 1.5, 1.33, 0.97, 0.53, 0.41, 0.18, -0.76],
                    "name": "ENSO-ASC",
                    "type": "line"
                }, {
                    "data": [-0.44, -0.29, -0.15, 0.23, 0.46, 0.7, 0.94, 1.12, 1.14, 1.52, 1.69, 1.81, 1.7, 1.42, 0.94, 0.67, 0.37, 0.27],
                    "name": "ENSO-Cross",
                    "type": "line"
                }, {
                    "data": [-0.6, -0.33, -0.06, 0.13, 0.18, 0.12, 0.09, 0.12, 0.16, 0.33, 0.14, 0.29, 0.14, -0.04, -0.17, 0.01, -0.05, -0.12],
                    "name": "ENSO-GTC",
                    "type": "line"
                }, {
                    "data": [-0.84, -1.11, -1.45, -1.34, -1.1, -0.69, -0.28, -0.13, -0.11, -0.12, -0.01, 0.06, -0.17, -0.71, -1.25, -1.2, -0.94, -0.57],
                    "name": "ENSO-MC",
                    "type": "line"
                }]
            },
            "2023-03": {
                "xAxis": {
                    "data": ["Feb-23", "Mar-23", "Apr-23", "May-23", "Jun-23", "Jul-23", "Aug-23", "Sep-23", "Oct-23", "Nov-23", "Dec-23", "Jan-24", "Feb-24", "Mar-24", "Apr-24", "May-24", "Jun-24", "Jul-24"]
                },
                "series": [{
                    "data": [2.53, 2.35, 2.31, -0.13, -0.07, -0.02, 0.08, 0.11, 0.22, 0.47, 0.56, 0.92, 0.75, 0.41, 0.01, -0.03, -0.11, -0.29],
                    "name": "ef",
                    "type": "line"
                }, {
                    "data": [-0.25, 0.34, 0.41, 0.45, 0.19, -0.22, -0.44, -0.67, -0.32, 0.14, 0.41, 1.5, 1.33, 0.97, 0.53, 0.41, 0.18, -0.76],
                    "name": "ENSO-ASC",
                    "type": "line"
                }, {
                    "data": [-0.44, -0.29, -0.15, 0.23, 0.46, 0.7, 0.94, 1.12, 1.14, 1.52, 1.69, 1.81, 1.7, 1.42, 0.94, 0.67, 0.37, 0.27],
                    "name": "ENSO-Cross",
                    "type": "line"
                }, {
                    "data": [-0.6, -0.33, -0.06, 0.13, 0.18, 0.12, 0.09, 0.12, 0.16, 0.33, 0.14, 0.29, 0.14, -0.04, -0.17, 0.01, -0.05, -0.12],
                    "name": "ENSO-GTC",
                    "type": "line"
                }, {
                    "data": [-0.84, -1.11, -1.45, -1.34, -1.1, -0.69, -0.28, -0.13, -0.11, -0.12, -0.01, 0.06, -0.17, -0.71, -1.25, -1.2, -0.94, -0.57],
                    "name": "ENSO-MC",
                    "type": "line"
                }]
            }
        },


    })


}


App({
    onLaunch() {
        // 展示本地存储能力
        // const logs = wx.getStorageSync('logs') || []
        // logs.unshift(Date.now())
        // wx.setStorageSync('logs', logs)

        // 登录
        // wx.login({
        //     success: res => {
        //         // 发送 res.code 到后台换取 openId, sessionKey, unionId
        //     }
        // })
    },
    globalData: {
        baseUrl: 'https://www.tjensoprediction.com:8888'
    }
})